Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::RoutingSegmentRectangularCrossSectionData Struct Reference
MEP Element Manager
Defines the necessary data for placing RectangularRoutingSegments of a RoutingElement. More...
#include <MEPTypes.hpp>
 Public Member Functions
RoutingSegmentRectangularCrossSectionData (double width, double height)
Constructs a RoutingSegmentRectangularCrossSectionData.
 Public Attributes
 double  | width
Width of the cross section.
 double  | height
Height of the cross section.
Detailed Description
Defines the necessary data for placing RectangularRoutingSegments of a RoutingElement.
Constructor & Destructor Documentation
◆ RoutingSegmentRectangularCrossSectionData()
 ACAPI::MEP::RoutingSegmentRectangularCrossSectionData::RoutingSegmentRectangularCrossSectionData  |  ( |  double |  width,
|  double |  height )
inline
Constructs a RoutingSegmentRectangularCrossSectionData.
Parameters
width | The width of the RectangularRoutingSegment.
height | The height of the RectangularRoutingSegment.